In [1]:
import pandas as pd

In [3]:
s = pd.Series(['Wes McKinney','Creator of Pandas'])
s

0         Wes McKinney
1    Creator of Pandas
dtype: object

In [4]:
s = pd.Series(['Wes McKinney','Creator of Pandas'],
              index = ['Person','Who'])
s

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [7]:
pd.DataFrame([['Wes McKinney','Creator of Pandas'], [1,2]])

              0                  1
0  Wes McKinney  Creator of Pandas
1             1                  2

In [9]:
name = ['김', '최', '박']
age = [20, 30, 40]

In [13]:
pd.DataFrame({'Name': name,'Age': age})

  Name  Age
0    김   20
1    최   30
2    박   40

In [15]:
pd.DataFrame({'Name': ['김','최'], 'Age':[20,30]})

  Name  Age
0    김   20
1    최   30

In [17]:
import numpy as np

In [18]:
pd.DataFrame(np.ones((3,5)))

     0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0  1.0

In [22]:
df = pd.read_csv('./data/scientists.csv')
df.set_index('Name', inplace = True)

In [23]:
df

                            Born        Died  Age          Occupation
Name
Rosaline Franklin     1920-07-25  1958-04-16   37             Chemist
William Gosset        1876-06-13  1937-10-16   61        Statistician
Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
Marie Curie           1867-11-07  1934-07-04   66             Chemist
Rachel Carson         1907-05-27  1964-04-14   56           Biologist
John Snow             1813-03-15  1858-06-16   45           Physician
Alan Turing           1912-06-23  1954-06-07   41  Computer Scientist
Johann Gauss          1777-04-30  1855-02-23   77       Mathematician

In [21]:
df.loc['William Gosset']

Born            1876-06-13
Died            1937-10-16
Age                     61
Occupation    Statistician
Name: William Gosset, dtype: object

In [24]:
df.loc[:,'Born']

Name
Rosaline Franklin       1920-07-25
William Gosset          1876-06-13
Florence Nightingale    1820-05-12
Marie Curie             1867-11-07
Rachel Carson           1907-05-27
John Snow               1813-03-15
Alan Turing             1912-06-23
Johann Gauss            1777-04-30
Name: Born, dtype: object

In [26]:
df['Age'].sum()

473